; domain
(define (domain blocksworld-domain)
 (:requirements :strips :typing :constraints :action-costs)
 (:types block)
 (:predicates (clear ?obj - block) (ontable ?obj - block) (handempty) (holding ?obj - block) (on ?obj1 - block ?obj2 - block))
 (:functions (total-cost))
 (:action pickup
  :parameters ( ?obj - block)
  :precondition (and (clear ?obj) (ontable ?obj) (handempty))
  :effect (and (holding ?obj) (not (clear ?obj)) (not (ontable ?obj)) (not (handempty)) (increase (total-cost) 1)))
 (:action putdown
  :parameters ( ?obj - block)
  :precondition (and (holding ?obj))
  :effect (and (clear ?obj) (handempty) (ontable ?obj) (not (holding ?obj)) (increase (total-cost) 1)))
 (:action stack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (clear ?underobj) (holding ?obj))
  :effect (and (handempty) (clear ?obj) (on ?obj ?underobj) (not (clear ?underobj)) (not (holding ?obj)) (increase (total-cost) 1)))
 (:action unstack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (on ?obj ?underobj) (clear ?obj) (handempty))
  :effect (and (holding ?obj) (clear ?underobj) (not (on ?obj ?underobj)) (not (clear ?obj)) (not (handempty)) (increase (total-cost) 1)))
)

; problem
(define (problem blocksworld-problem)
 (:domain blocksworld-domain)
 (:objects
   grey_block_1 grey_block_2 white_block_1 blue_block_1 purple_block_1 orange_block_1 red_block_1 - block
 )
 (:init (ontable grey_block_1) (ontable grey_block_2) (on white_block_1 grey_block_1) (on blue_block_1 white_block_1) (on purple_block_1 blue_block_1) (ontable orange_block_1) (on red_block_1 grey_block_2) (clear purple_block_1) (clear orange_block_1) (clear red_block_1) (handempty) (= (total-cost) 0))
 (:goal (and (on orange_block_1 blue_block_1)))
 (:metric minimize (total-cost))
)

; plan
1. (unstack purple_block_1 blue_block_1)
   deleted: (on purple_block_1 blue_block_1) (clear purple_block_1) (handempty)
   added: (holding purple_block_1) (clear blue_block_1)
   goals met: 0 of 1
2. (putdown purple_block_1)
   deleted: (holding purple_block_1)
   added: (clear purple_block_1) (handempty) (ontable purple_block_1)
   goals met: 0 of 1
3. (pickup orange_block_1)
   deleted: (clear orange_block_1) (ontable orange_block_1) (handempty)
   added: (holding orange_block_1)
   goals met: 0 of 1
4. (stack orange_block_1 blue_block_1)
   deleted: (clear blue_block_1) (holding orange_block_1)
   added: (handempty) (clear orange_block_1) (on orange_block_1 blue_block_1)
   goals met: 1 of 1
